---
type: SymbolGeometryId
namespace: Autodesk.Revit.DB
version: 2024
members: 4
tags: [revit-api, class]
---

# SymbolGeometryId

`Autodesk.Revit.DB.SymbolGeometryId` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | AsUniqueIdentifier | 2023 | `public string AsUniqueIdentifier ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | SymbolId | 2023 | `public ElementId SymbolId { get ; }` |